zzp2233/TMX-PRB480/PRB480_PY32CA70/Drivers/CMSIS/Device/PY32CA7xx/Include/py32ca70x4.h
#define GPIO_AFR_AFSEL2_Pos            (8U)
#define GPIO_AFR_AFSEL2_Msk            (0xFUL << GPIO_AFR_AFSEL2_Pos)          /*!< 0x00000F00 */
#define GPIO_AFR_AFSEL2                GPIO_AFR_AFSEL2_Msk
#define GPIO_AFR_AFSEL2_0              (0x1UL << GPIO_AFR_AFSEL2_Pos)          /*!< 0x00000100 */
#define GPIO_AFR_AFSEL2_1              (0x2UL << GPIO_AFR_AFSEL2_Pos)          /*!< 0x00000200 */
#define GPIO_AFR_AFSEL2_2              (0x4UL << GPIO_AFR_AFSEL2_Pos)          /*!< 0x00000400 */
#define GPIO_AFR_AFSEL2_3              (0x8UL << GPIO_AFR_AFSEL2_Pos)          /*!< 0x00000800 */

#define GPIO_AFR_AFSEL3_Pos            (12U)
#define GPIO_AFR_AFSEL3_Msk            (0xFUL << GPIO_AFR_AFSEL3_Pos)          /*!< 0x0000F000 */
#define GPIO_AFR_AFSEL3                GPIO_AFR_AFSEL3_Msk
#define GPIO_AFR_AFSEL3_0              (0x1UL << GPIO_AFR_AFSEL3_Pos)          /*!< 0x00001000 */
#define GPIO_AFR_AFSEL3_1              (0x2UL << GPIO_AFR_AFSEL3_Pos)          /*!< 0x00002000 */
#define GPIO_AFR_AFSEL3_2              (0x4UL << GPIO_AFR_AFSEL3_Pos)          /*!< 0x00004000 */
#define GPIO_AFR_AFSEL3_3              (0x8UL << GPIO_AFR_AFSEL3_Pos)          /*!< 0x00008000 */

#define GPIO_AFR_AFSEL4_Pos            (16U)
#define GPIO_AFR_AFSEL4_Msk            (0xFUL << GPIO_AFR_AFSEL4_Pos)          /*!< 0x000F0000 */
#define GPIO_AFR_AFSEL4                GPIO_AFR_AFSEL4_Msk
#define GPIO_AFR_AFSEL4_0              (0x1UL << GPIO_AFR_AFSEL4_Pos)          /*!< 0x00010000 */
#define GPIO_AFR_AFSEL4_1              (0x2UL << GPIO_AFR_AFSEL4_Pos)          /*!< 0x00020000 */
#define GPIO_AFR_AFSEL4_2              (0x4UL << GPIO_AFR_AFSEL4_Pos)          /*!< 0x00040000 */
#define GPIO_AFR_AFSEL4_3              (0x8UL << GPIO_AFR_AFSEL4_Pos)          /*!< 0x00080000 */

#define GPIO_AFR_AFSEL5_Pos            (20U)
#define GPIO_AFR_AFSEL5_Msk            (0xFUL << GPIO_AFR_AFSEL5_Pos)          /*!< 0x00F00000 */
#define GPIO_AFR_AFSEL5                GPIO_AFR_AFSEL5_Msk
#define GPIO_AFR_AFSEL5_0              (0x1UL << GPIO_AFR_AFSEL5_Pos)          /*!< 0x00100000 */
#define GPIO_AFR_AFSEL5_1              (0x2UL << GPIO_AFR_AFSEL5_Pos)          /*!< 0x00200000 */
#define GPIO_AFR_AFSEL5_2              (0x4UL << GPIO_AFR_AFSEL5_Pos)          /*!< 0x00400000 */
#define GPIO_AFR_AFSEL5_3              (0x8UL << GPIO_AFR_AFSEL5_Pos)          /*!< 0x00800000 */

#define GPIO_AFR_AFSEL6_Pos            (24U)
#define GPIO_AFR_AFSEL6_Msk            (0xFUL << GPIO_AFR_AFSEL6_Pos)          /*!< 0x0F000000 */
#define GPIO_AFR_AFSEL6                GPIO_AFR_AFSEL6_Msk
#define GPIO_AFR_AFSEL6_0              (0x1UL << GPIO_AFR_AFSEL6_Pos)          /*!< 0x01000000 */
#define GPIO_AFR_AFSEL6_1              (0x2UL << GPIO_AFR_AFSEL6_Pos)          /*!< 0x02000000 */
#define GPIO_AFR_AFSEL6_2              (0x4UL << GPIO_AFR_AFSEL6_Pos)          /*!< 0x04000000 */
#define GPIO_AFR_AFSEL6_3              (0x8UL << GPIO_AFR_AFSEL6_Pos)          /*!< 0x08000000 */

#define GPIO_AFR_AFSEL7_Pos            (28U)
#define GPIO_AFR_AFSEL7_Msk            (0xFUL << GPIO_AFR_AFSEL7_Pos)          /*!< 0xF0000000 */
#define GPIO_AFR_AFSEL7                GPIO_AFR_AFSEL7_Msk
#define GPIO_AFR_AFSEL7_0              (0x1UL << GPIO_AFR_AFSEL7_Pos)          /*!< 0x10000000 */
#define GPIO_AFR_AFSEL7_1              (0x2UL << GPIO_AFR_AFSEL7_Pos)          /*!< 0x20000000 */
#define GPIO_AFR_AFSEL7_2              (0x4UL << GPIO_AFR_AFSEL7_Pos)          /*!< 0x40000000 */
#define GPIO_AFR_AFSEL7_3              (0x8UL << GPIO_AFR_AFSEL7_Pos)          /*!< 0x80000000 */

/****************** Bits definition for GPIO_BRR register *********************/
#define GPIO_BRR_BR0_Pos               (0U)
#define GPIO_BRR_BR0_Msk               (0x1UL << GPIO_BRR_BR0_Pos)             /*!< 0x00000001 */
#define GPIO_BRR_BR0                   GPIO_BRR_BR0_Msk
#define GPIO_BRR_BR1_Pos               (1U)
#define GPIO_BRR_BR1_Msk               (0x1UL << GPIO_BRR_BR1_Pos)             /*!< 0x00000002 */
#define GPIO_BRR_BR1                   GPIO_BRR_BR1_Msk
#define GPIO_BRR_BR2_Pos               (2U)
#define GPIO_BRR_BR2_Msk               (0x1UL << GPIO_BRR_BR2_Pos)             /*!< 0x00000004 */
#define GPIO_BRR_BR2                   GPIO_BRR_BR2_Msk
#define GPIO_BRR_BR3_Pos               (3U)
#define GPIO_BRR_BR3_Msk               (0x1UL << GPIO_BRR_BR3_Pos)             /*!< 0x00000008 */
#define GPIO_BRR_BR3                   GPIO_BRR_BR3_Msk
#define GPIO_BRR_BR4_Pos               (4U)
#define GPIO_BRR_BR4_Msk               (0x1UL << GPIO_BRR_BR4_Pos)             /*!< 0x00000010 */
#define GPIO_BRR_BR4                   GPIO_BRR_BR4_Msk
#define GPIO_BRR_BR5_Pos               (5U)
#define GPIO_BRR_BR5_Msk               (0x1UL << GPIO_BRR_BR5_Pos)             /*!< 0x00000020 */
#define GPIO_BRR_BR5                   GPIO_BRR_BR5_Msk
#define GPIO_BRR_BR6_Pos               (6U)
#define GPIO_BRR_BR6_Msk               (0x1UL << GPIO_BRR_BR6_Pos)             /*!< 0x00000040 */
#define GPIO_BRR_BR6                   GPIO_BRR_BR6_Msk
#define GPIO_BRR_BR7_Pos               (7U)
#define GPIO_BRR_BR7_Msk               (0x1UL << GPIO_BRR_BR7_Pos)             /*!< 0x00000080 */
#define GPIO_BRR_BR7                   GPIO_BRR_BR7_Msk

/******************************************************************************/
/*                                                                            */
/*                        Independent WATCHDOG (IWDG)                         */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for IWDG_KR register  ********************/
#define IWDG_KR_KEY_Pos      (0U)
#define IWDG_KR_KEY_Msk      (0xFFFFUL << IWDG_KR_KEY_Pos)                     /*!< 0x0000FFFF */
#define IWDG_KR_KEY          IWDG_KR_KEY_Msk                                   /*!<Key value (write only, read 0000h)  */

/*******************  Bit definition for IWDG_PR register  ********************/
#define IWDG_PR_PR_Pos       (0U)
#define IWDG_PR_PR_Msk       (0x7UL << IWDG_PR_PR_Pos)                         /*!< 0x00000007 */
#define IWDG_PR_PR           IWDG_PR_PR_Msk                                    /*!<PR[2:0] (Prescaler divider)         */
#define IWDG_PR_PR_0         (0x1UL << IWDG_PR_PR_Pos)                         /*!< 0x00000001 */
#define IWDG_PR_PR_1         (0x2UL << IWDG_PR_PR_Pos)                         /*!< 0x00000002 */
#define IWDG_PR_PR_2         (0x4UL << IWDG_PR_PR_Pos)                         /*!< 0x00000004 */

