zzp2233/TMX-PRB480/PRB480_PY32CA70/Drivers/CMSIS/Device/PY32CA7xx/Include/py32ca70x4.h
/*******************  Bit definition for IWDG_RLR register  *******************/
#define IWDG_RLR_RL_Pos      (0U)
#define IWDG_RLR_RL_Msk      (0xFFFUL << IWDG_RLR_RL_Pos)                      /*!< 0x00000FFF */
#define IWDG_RLR_RL          IWDG_RLR_RL_Msk                                   /*!<Watchdog counter reload value        */

/*******************  Bit definition for IWDG_SR register  ********************/
#define IWDG_SR_PVU_Pos      (0U)
#define IWDG_SR_PVU_Msk      (0x1UL << IWDG_SR_PVU_Pos)                        /*!< 0x00000001 */
#define IWDG_SR_PVU          IWDG_SR_PVU_Msk                                   /*!< Watchdog prescaler value update */
#define IWDG_SR_RVU_Pos      (1U)
#define IWDG_SR_RVU_Msk      (0x1UL << IWDG_SR_RVU_Pos)                        /*!< 0x00000002 */
#define IWDG_SR_RVU          IWDG_SR_RVU_Msk                                   /*!< Watchdog counter reload value update */

/******************************************************************************/
/*                                                                            */
/*                        Power Control (PWR)                                 */
/*                                                                            */
/******************************************************************************/
#define PWR_DEEPSTOP_SUPPORT                  /*!< PWR feature available only on specific devices: Deep stop feature */

/********************  Bit definition for PWR_CR1 register  ********************/
#define PWR_CR1_FLS_SLPTIME_Pos                   (12U)
#define PWR_CR1_FLS_SLPTIME_Msk                   (0x3UL<<PWR_CR1_FLS_SLPTIME_Pos)                  /*!< 0x00003000 */
#define PWR_CR1_FLS_SLPTIME                       PWR_CR1_FLS_SLPTIME_Msk
#define PWR_CR1_FLS_SLPTIME_0                     (0x1UL<<PWR_CR1_FLS_SLPTIME_Pos)                  /*!< 0x00001000 */
#define PWR_CR1_FLS_SLPTIME_1                     (0x2UL<<PWR_CR1_FLS_SLPTIME_Pos)                  /*!< 0x00002000 */
#define PWR_CR1_VR_MODE_Pos                       (14U)
#define PWR_CR1_VR_MODE_Msk                       (0x3UL<<PWR_CR1_VR_MODE_Pos)                      /*!< 0x000C0000 */
#define PWR_CR1_VR_MODE                           PWR_CR1_VR_MODE_Msk
#define PWR_CR1_VR_MODE_0                         (0x1UL<<PWR_CR1_VR_MODE_Pos)                      /*!< 0x00040000 */
#define PWR_CR1_VR_MODE_1                         (0x2UL<<PWR_CR1_VR_MODE_Pos)                      /*!< 0x00080000 */
#define PWR_CR1_HSION_CTRL_Pos                    (22U)
#define PWR_CR1_HSION_CTRL_Msk                    (0x1UL<<PWR_CR1_HSION_CTRL_Pos)                   /*!< 0x00400000 */
#define PWR_CR1_HSION_CTRL                        PWR_CR1_HSION_CTRL_Msk                            

/********************************* Bit definition for PWR_CR2 register **********************************************/
#define PWR_CR2_PVDE_Pos                          (0U)
#define PWR_CR2_PVDE_Msk                          (0x1UL<<PWR_CR2_PVDE_Pos)                         /*!< 0x00000001 */
#define PWR_CR2_PVDE                              PWR_CR2_PVDE_Msk                                  
#define PWR_CR2_PVDT_Pos                          (4U)
#define PWR_CR2_PVDT_Msk                          (0x7UL<<PWR_CR2_PVDT_Pos)                         /*!< 0x00000070 */
#define PWR_CR2_PVDT                              PWR_CR2_PVDT_Msk
#define PWR_CR2_PVDT_0                            (0x1UL<<PWR_CR2_PVDT_Pos)                         /*!< 0x00000010 */
#define PWR_CR2_PVDT_1                            (0x2UL<<PWR_CR2_PVDT_Pos)                         /*!< 0x00000020 */
#define PWR_CR2_PVDT_2                            (0x4UL<<PWR_CR2_PVDT_Pos)                         /*!< 0x00000040 */
#define PWR_CR2_PVD_OUT_SEL_Pos                   (7U)
#define PWR_CR2_PVD_OUT_SEL_Msk                   (0x1UL<<PWR_CR2_PVD_OUT_SEL_Pos)                  /*!< 0x00000080 */
#define PWR_CR2_PVD_OUT_SEL                       PWR_CR2_PVD_OUT_SEL_Msk      
#define PWR_CR2_FLTEN_Pos                         (8U)
#define PWR_CR2_FLTEN_Msk                         (0x1UL<<PWR_CR2_FLTEN_Pos)                        /*!< 0x00000100 */
#define PWR_CR2_FLTEN                             PWR_CR2_FLTEN_Msk                                 
#define PWR_CR2_FLT_TIME_Pos                      (9U)
#define PWR_CR2_FLT_TIME_Msk                      (0x7UL<<PWR_CR2_FLT_TIME_Pos)                     /*!< 0x00000E00 */
#define PWR_CR2_FLT_TIME                          PWR_CR2_FLT_TIME_Msk
#define PWR_CR2_FLT_TIME_0                        (0x1UL<<PWR_CR2_FLT_TIME_Pos)                     /*!< 0x00000200 */
#define PWR_CR2_FLT_TIME_1                        (0x2UL<<PWR_CR2_FLT_TIME_Pos)                     /*!< 0x00000400 */
#define PWR_CR2_FLT_TIME_2                        (0x4UL<<PWR_CR2_FLT_TIME_Pos)                     /*!< 0x00000800 */

/********************************* Bit definition for PWR_SR register ***********************************************/
#define PWR_SR_PVDO_Pos                           (11U)
#define PWR_SR_PVDO_Msk                           (0x1UL<<PWR_SR_PVDO_Pos)                          /*!< 0x00000800 */
#define PWR_SR_PVDO                               PWR_SR_PVDO_Msk      

/******************************************************************************/
/*                                                                            */
/*                           Reset and Clock Control (RCC)                    */
/*                                                                            */
/******************************************************************************/
/*
* @brief Specific device feature definitions
*/
#define RCC_LSE_SUPPORT

/********************  Bit definition for RCC_CR register  *****************/
#define RCC_CR_HSION_Pos                 (8U)
#define RCC_CR_HSION_Msk                 (0x1UL << RCC_CR_HSION_Pos)           /*!< 0x00000100 */
#define RCC_CR_HSION                     RCC_CR_HSION_Msk                      /*!< Internal High Speed clock enable */
#define RCC_CR_HSIRDY_Pos                (10U)
#define RCC_CR_HSIRDY_Msk                (0x1UL << RCC_CR_HSIRDY_Pos)          /*!< 0x00000400 */
#define RCC_CR_HSIRDY                    RCC_CR_HSIRDY_Msk                     /*!< Internal High Speed clock ready flag */
#define RCC_CR_HSIDIV_Pos                (11U)
#define RCC_CR_HSIDIV_Msk                (0x7UL << RCC_CR_HSIDIV_Pos)          /*!< 0x00003800 */
#define RCC_CR_HSIDIV                    RCC_CR_HSIDIV_Msk                     /*!< HSIDIV[13:11] Internal High Speed clock division factor */
#define RCC_CR_HSIDIV_0                  (0x1UL << RCC_CR_HSIDIV_Pos)          /*!< 0x00000800 */
#define RCC_CR_HSIDIV_1                  (0x2UL << RCC_CR_HSIDIV_Pos)          /*!< 0x00001000 */
#define RCC_CR_HSIDIV_2                  (0x4UL << RCC_CR_HSIDIV_Pos)          /*!< 0x00002000 */
#define RCC_CR_HSEON_Pos                 (18U)
#define RCC_CR_HSEON_Msk                 (0x1UL << RCC_CR_HSEON_Pos)           /*!< 0x00040000 */
#define RCC_CR_HSEON                     RCC_CR_HSEON_Msk                      /*!< External High Speed clock enable */

/********************  Bit definition for RCC_ICSCR register  ***************/
#define RCC_ICSCR_HSI_ABS_TRIMCR_Pos      (0U)
#define RCC_ICSCR_HSI_ABS_TRIMCR_Msk      (0xFFFUL << RCC_ICSCR_HSI_ABS_TRIMCR_Pos)    /*!< 0x00000FFF */
#define RCC_ICSCR_HSI_ABS_TRIMCR          RCC_ICSCR_HSI_ABS_TRIMCR_Msk                 /*!< HSI_ABS_TRIM[11:0] bits */
#define RCC_ICSCR_HSI_ABS_TRIMCR_0        (0x01UL << RCC_ICSCR_HSI_ABS_TRIMCR_Pos)     /*!< 0x00000001 */
#define RCC_ICSCR_HSI_ABS_TRIMCR_1        (0x02UL << RCC_ICSCR_HSI_ABS_TRIMCR_Pos)     /*!< 0x00000002 */
#define RCC_ICSCR_HSI_ABS_TRIMCR_2        (0x04UL << RCC_ICSCR_HSI_ABS_TRIMCR_Pos)     /*!< 0x00000004 */
#define RCC_ICSCR_HSI_ABS_TRIMCR_3        (0x08UL << RCC_ICSCR_HSI_ABS_TRIMCR_Pos)     /*!< 0x00000008 */
#define RCC_ICSCR_HSI_ABS_TRIMCR_4        (0x10UL << RCC_ICSCR_HSI_ABS_TRIMCR_Pos)     /*!< 0x00000010 */
#define RCC_ICSCR_HSI_ABS_TRIMCR_5        (0x20UL << RCC_ICSCR_HSI_ABS_TRIMCR_Pos)     /*!< 0x00000020 */
#define RCC_ICSCR_HSI_ABS_TRIMCR_6        (0x40UL << RCC_ICSCR_HSI_ABS_TRIMCR_Pos)     /*!< 0x00000040 */
#define RCC_ICSCR_HSI_ABS_TRIMCR_7        (0x80UL << RCC_ICSCR_HSI_ABS_TRIMCR_Pos)     /*!< 0x00000080 */
#define RCC_ICSCR_HSI_ABS_TRIMCR_8        (0x100UL << RCC_ICSCR_HSI_ABS_TRIMCR_Pos)    /*!< 0x00000100 */
#define RCC_ICSCR_HSI_ABS_TRIMCR_9        (0x200UL << RCC_ICSCR_HSI_ABS_TRIMCR_Pos)    /*!< 0x00000200 */
#define RCC_ICSCR_HSI_ABS_TRIMCR_10       (0x400UL << RCC_ICSCR_HSI_ABS_TRIMCR_Pos)    /*!< 0x00000400 */
#define RCC_ICSCR_HSI_ABS_TRIMCR_11       (0x800UL << RCC_ICSCR_HSI_ABS_TRIMCR_Pos)    /*!< 0x00000800 */
#define RCC_ICSCR_HSI_TC_TRIMCR_Pos       (12U)
#define RCC_ICSCR_HSI_TC_TRIMCR_Msk       (0xFUL << RCC_ICSCR_HSI_TC_TRIMCR_Pos)     /*!< 0x0000F000 */
#define RCC_ICSCR_HSI_TC_TRIMCR           RCC_ICSCR_HSI_TC_TRIMCR_Msk                 /*!< HSI_TC_TRIM[3:0] bits */
#define RCC_ICSCR_HSI_TC_TRIMCR_0         (0x01UL << RCC_ICSCR_HSI_TC_TRIMCR_Pos)     /*!< 0x00000001 */
#define RCC_ICSCR_HSI_TC_TRIMCR_1         (0x02UL << RCC_ICSCR_HSI_TC_TRIMCR_Pos)     /*!< 0x00000002 */
#define RCC_ICSCR_HSI_TC_TRIMCR_2         (0x04UL << RCC_ICSCR_HSI_TC_TRIMCR_Pos)     /*!< 0x00000004 */
#define RCC_ICSCR_HSI_TC_TRIMCR_3         (0x08UL << RCC_ICSCR_HSI_TC_TRIMCR_Pos)     /*!< 0x00000008 */
#define RCC_ICSCR_HSI_FS_CR_Pos           (16U)
#define RCC_ICSCR_HSI_FS_CR_Msk           (0x1UL << RCC_ICSCR_HSI_FS_CR_Pos)   /*!< 0x00010000 */
#define RCC_ICSCR_HSI_FS_CR               RCC_ICSCR_HSI_FS_CR_Msk              /*!< HSIFS bit  */
#define RCC_ICSCR_LSI_TRIM_Pos            (19U)
#define RCC_ICSCR_LSI_TRIM_Msk            (0x1FFUL << RCC_ICSCR_LSI_TRIM_Pos)
#define RCC_ICSCR_LSI_TRIM                RCC_ICSCR_LSI_TRIM_Msk
#define RCC_ICSCR_LSI_TRIM_0              (0x01UL << RCC_ICSCR_LSI_TRIM_Pos)
#define RCC_ICSCR_LSI_TRIM_1              (0x02UL << RCC_ICSCR_LSI_TRIM_Pos)
#define RCC_ICSCR_LSI_TRIM_2              (0x04UL << RCC_ICSCR_LSI_TRIM_Pos)
#define RCC_ICSCR_LSI_TRIM_3              (0x08UL << RCC_ICSCR_LSI_TRIM_Pos)
#define RCC_ICSCR_LSI_TRIM_4              (0x10UL << RCC_ICSCR_LSI_TRIM_Pos)
#define RCC_ICSCR_LSI_TRIM_5              (0x20UL << RCC_ICSCR_LSI_TRIM_Pos)
#define RCC_ICSCR_LSI_TRIM_6              (0x40UL << RCC_ICSCR_LSI_TRIM_Pos)
#define RCC_ICSCR_LSI_TRIM_7              (0x80UL << RCC_ICSCR_LSI_TRIM_Pos)
#define RCC_ICSCR_LSI_TRIM_8              (0x100UL << RCC_ICSCR_LSI_TRIM_Pos)

/********************  Bit definition for RCC_CFGR register  ***************/
/*!< SW configuration */
#define RCC_CFGR_SW_Pos                (0U)
#define RCC_CFGR_SW_Msk                (0x7UL << RCC_CFGR_SW_Pos)              /*!< 0x00000007 */
#define RCC_CFGR_SW                    RCC_CFGR_SW_Msk                         /*!< SW[2:0] bits (System clock Switch) */
#define RCC_CFGR_SW_0                  (0x1UL << RCC_CFGR_SW_Pos)              /*!< 0x00000001 */
#define RCC_CFGR_SW_1                  (0x2UL << RCC_CFGR_SW_Pos)              /*!< 0x00000002 */
#define RCC_CFGR_SW_2                  (0x4UL << RCC_CFGR_SW_Pos)              /*!< 0x00000004 */

