zzp2233/TMX-PRB480/PRB480_PY32CA70/Drivers/CMSIS/Device/PY32CA7xx/Include/py32ca70x4.h
/********************************* Bit definition for PWM_CNT register **********************************************/
#define PWM_CNT_CNT_Pos                           (0U)
#define PWM_CNT_CNT_Msk                           (0x3FFUL<<PWM_CNT_CNT_Pos)                       /*!< 0x000003FF */
#define PWM_CNT_CNT                               PWM_CNT_CNT_Msk

/********************************* Bit definition for PWM_PSC register **********************************************/
#define PWM_PSC_PSC_Pos                           (0U)
#define PWM_PSC_PSC_Msk                           (0xFFUL<<PWM_PSC_PSC_Pos)                       /*!< 0x000000FF */
#define PWM_PSC_PSC                               PWM_PSC_PSC_Msk

/********************************* Bit definition for PWM_ARR register **********************************************/
#define PWM_ARR_ARR_Pos                           (0U)
#define PWM_ARR_ARR_Msk                           (0x3FFUL<<PWM_ARR_ARR_Pos)                       /*!< 0x000003FF */
#define PWM_ARR_ARR                               PWM_ARR_ARR_Msk

/********************************* Bit definition for PWM_CCR1 register *********************************************/
#define PWM_CCR1_CCR1_Pos                         (0U)
#define PWM_CCR1_CCR1_Msk                         (0x3FFUL<<PWM_CCR1_CCR1_Pos)                     /*!< 0x000003FF */
#define PWM_CCR1_CCR1                             PWM_CCR1_CCR1_Msk

/********************************* Bit definition for PWM_LED1 register *********************************************/
#define PWM_LED1_DATA_Pos                         (0U)
#define PWM_LED1_DATA_Msk                         (0xFFFFFFUL<<PWM_LED1_DATA_Pos)                     /*!< 0x00FFFFFF */
#define PWM_LED1_DATA                             PWM_LED1_DATA_Msk

/******************************************************************************/
/*                                                                            */
/*      Universal Synchronous Asynchronous Receiver Transmitter (UART)        */
/*                                                                            */
/******************************************************************************/
/******************  Bit definition for UART_DR register **********************/
#define UART_DR_DR_Pos              (0U)
#define UART_DR_DR_Msk              (0x1FFUL<<UART_DR_DR_Pos)                  /*!< 0x000001FF */
#define UART_DR_DR                  UART_DR_DR_Msk                             /*!< Receive/send data register */

/******************  Bit definition for UART_BRR register **********************/
#define UART_BRR_BRR_Pos            (0U)
#define UART_BRR_BRR_Msk            (0xFFFFUL<<UART_BRR_BRR_Pos)                /*!< 0x0000FFFF */
#define UART_BRR_BRR                UART_BRR_BRR_Msk                            /*!< Baud rate register */

/******************  Bit definition for UART_SR register **********************/
#define UART_SR_RXNE_Pos            (0U)
#define UART_SR_RXNE_Msk            (0x1UL<<UART_SR_RXNE_Pos)                  /*!< 0x00000001 */
#define UART_SR_RXNE                UART_SR_RXNE_Msk                           /*!< Receive register not empty */
#define UART_SR_ORE_Pos             (1U)
#define UART_SR_ORE_Msk             (0x1UL<<UART_SR_ORE_Pos)                   /*!< 0x00000002 */
#define UART_SR_ORE                 UART_SR_ORE_Msk                            /*!< Overrun error bit */
#define UART_SR_PE_Pos              (2U)
#define UART_SR_PE_Msk              (0x1UL<<UART_SR_PE_Pos)                    /*!< 0x00000004 */
#define UART_SR_PE                  UART_SR_PE_Msk                             /*!< Parity Error bit */
#define UART_SR_FE_Pos              (3U)
#define UART_SR_FE_Msk              (0x1UL<<UART_SR_FE_Pos)                    /*!< 0x00000008 */
#define UART_SR_FE                  UART_SR_FE_Msk                             /*!< Framing Error bit */
#define UART_SR_BRI_Pos             (4U)
#define UART_SR_BRI_Msk             (0x1UL<<UART_SR_BRI_Pos)                   /*!< 0x00000010 */
#define UART_SR_BRI                 UART_SR_BRI_Msk                            /*!< Break Interrupt bit */
#define UART_SR_TDRE_Pos            (5U)
#define UART_SR_TDRE_Msk            (0x1UL<<UART_SR_TDRE_Pos)                  /*!< 0x00000020 */
#define UART_SR_TDRE                UART_SR_TDRE_Msk                           /*!< Transmit Holding Register Empty bit */
#define UART_SR_TXE_Pos             (6U)
#define UART_SR_TXE_Msk             (0x1UL<<UART_SR_TXE_Pos)                   /*!< 0x00000040 */
#define UART_SR_TXE                 UART_SR_TXE_Msk                            /*!< Transmitter Empty bit */
#define UART_SR_ADDR_RCVD_Pos       (8U)
#define UART_SR_ADDR_RCVD_Msk       (0x1UL<<UART_SR_ADDR_RCVD_Pos)             /*!< 0x00000100 */
#define UART_SR_ADDR_RCVD           UART_SR_ADDR_RCVD_Msk                      /*!< Address Received Bit */
#define UART_SR_BUSY_Pos            (9U)
#define UART_SR_BUSY_Msk            (0x1UL<<UART_SR_BUSY_Pos)                  /*!< 0x00000200 */
#define UART_SR_BUSY                UART_SR_BUSY_Msk                           /*!< UART Busy */
#define UART_SR_BUSY_ERR_Pos        (10U)
#define UART_SR_BUSY_ERR_Msk        (0x1UL<<UART_SR_BUSY_ERR_Pos)              /*!< 0x00000400 */
#define UART_SR_BUSY_ERR            UART_SR_BUSY_ERR_Msk                       /*!< Busy Detect Error */

/******************  Bit definition for UART_CR1 register **********************/
#define UART_CR1_M_Pos              (0U)
#define UART_CR1_M_Msk              (0x3UL<<UART_CR1_M_Pos)                     /*!< 0x00000003 */
#define UART_CR1_M                  UART_CR1_M_Msk                              /*!< Data Length Select */
#define UART_CR1_M_0                (0x1UL<<UART_CR1_M_Pos)                     /*!< 0x00000001 */
#define UART_CR1_M_1                (0x2UL<<UART_CR1_M_Pos)                     /*!< 0x00000002 */
#define UART_CR1_STOP_Pos           (2U)
#define UART_CR1_STOP_Msk           (0x1UL<<UART_CR1_STOP_Pos)                  /*!< 0x00000004 */
#define UART_CR1_STOP               UART_CR1_STOP_Msk                           /*!< Number of stop bits */
#define UART_CR1_PCE_Pos            (3U)
#define UART_CR1_PCE_Msk            (0x1UL<<UART_CR1_PCE_Pos)                   /*!< 0x00000008 */
#define UART_CR1_PCE                UART_CR1_PCE_Msk                            /*!< Parity Enable */
#define UART_CR1_PS_Pos             (4U)
#define UART_CR1_PS_Msk             (0x1UL<<UART_CR1_PS_Pos)                    /*!< 0x00000010 */
#define UART_CR1_PS                 UART_CR1_PS_Msk                             /*!< Even Parity Select */
#define UART_CR1_SP_Pos             (5U)
#define UART_CR1_SP_Msk             (0x1UL<<UART_CR1_SP_Pos)                    /*!< 0x00000020 */
#define UART_CR1_SP                 UART_CR1_SP_Msk                             /*!< Stick Parity */
#define UART_CR1_SBK_Pos            (6U)
#define UART_CR1_SBK_Msk            (0x1UL<<UART_CR1_SBK_Pos)                   /*!< 0x00000040 */
#define UART_CR1_SBK                UART_CR1_SBK_Msk                            /*!< Send Break */
#define UART_CR1_SWAP_Pos           (8U)
#define UART_CR1_SWAP_Msk           (0x1UL<<UART_CR1_SWAP_Pos)                  /*!< 0x00000100 */
#define UART_CR1_SWAP               UART_CR1_SWAP_Msk                           /*!< TX/RX pin swap */
#define UART_CR1_MSBFIRST_Pos       (9U)
#define UART_CR1_MSBFIRST_Msk       (0x1UL<<UART_CR1_MSBFIRST_Pos)              /*!< 0x00000200 */
#define UART_CR1_MSBFIRST           UART_CR1_MSBFIRST_Msk                       /*!< MSB first mode */

/******************  Bit definition for UART_CR2 register **********************/
#define UART_CR2_RXNEIE_Pos         (0U)
#define UART_CR2_RXNEIE_Msk         (0x1UL<<UART_CR2_RXNEIE_Pos)                /*!< 0x00000001 */
#define UART_CR2_RXNEIE             UART_CR2_RXNEIE_Msk                         /*!< Enable Received Data Available Interrupt */
#define UART_CR2_TDREIE_Pos         (1U)
#define UART_CR2_TDREIE_Msk         (0x1UL<<UART_CR2_TDREIE_Pos)                /*!< 0x00000002 */
#define UART_CR2_TDREIE             UART_CR2_TDREIE_Msk                         /*!< Enable Transmit Holding Register Empty Interrupt */
#define UART_CR2_LSIE_Pos           (2U)
#define UART_CR2_LSIE_Msk           (0x1UL<<UART_CR2_LSIE_Pos)                  /*!< 0x00000004 */
#define UART_CR2_LSIE               UART_CR2_LSIE_Msk                           /*!< Enable Receiver Line Status Interrupt */
#define UART_CR2_BUSYERRIE_Pos      (3U)
#define UART_CR2_BUSYERRIE_Msk      (0x1UL<<UART_CR2_BUSYERRIE_Pos)             /*!< 0x00000008 */
#define UART_CR2_BUSYERRIE          UART_CR2_BUSYERRIE_Msk                      /*!< Enable Busyerr state interruption */
#define UART_CR2_TXEIE_Pos          (4U)
#define UART_CR2_TXEIE_Msk          (0x1UL<<UART_CR2_TXEIE_Pos)                 /*!< 0x00000010 */
#define UART_CR2_TXEIE              UART_CR2_TXEIE_Msk                          /*!< Enable tx empty interruption */

