zzp2233/TMX-PRB480/PRB480_PY32CA70/Drivers/CMSIS/Device/PY32CA7xx/Include/py32ca70x4.h
/******************  Bit definition for UART_CR3 register **********************/
#define UART_CR3_M_E_Pos            (0U)
#define UART_CR3_M_E_Msk            (0x1UL<<UART_CR3_M_E_Pos)                   /*!< 0x00000001 */
#define UART_CR3_M_E                UART_CR3_M_E_Msk                            /*!< Extension for DLS */
#define UART_CR3_ADDR_MATCH_Pos     (1U)
#define UART_CR3_ADDR_MATCH_Msk     (0x1UL<<UART_CR3_ADDR_MATCH_Pos)            /*!< 0x00000002 */
#define UART_CR3_ADDR_MATCH         UART_CR3_ADDR_MATCH_Msk                     /*!<  Address Match Mode */
#define UART_CR3_SEND_ADDR_Pos      (2U)
#define UART_CR3_SEND_ADDR_Msk      (0x1UL<<UART_CR3_SEND_ADDR_Pos)             /*!< 0x00000004 */
#define UART_CR3_SEND_ADDR          UART_CR3_SEND_ADDR_Msk                      /*!< Send address control bit */
#define UART_CR3_TX_MODE_Pos        (3U)
#define UART_CR3_TX_MODE_Msk        (0x1UL<<UART_CR3_TX_MODE_Pos)               /*!< 0x00000008 */
#define UART_CR3_TX_MODE            UART_CR3_TX_MODE_Msk                        /*!< Transmit mode control bit */

/******************  Bit definition for UART_RAR register **********************/
#define UART_RAR_RAR_Pos            (0U)
#define UART_RAR_RAR_Msk            (0xFFUL<<UART_RAR_RAR_Pos)                  /*!< 0x000000FF */
#define UART_RAR_RAR                UART_RAR_RAR_Msk                            /*!< Receive address matching register */

/******************  Bit definition for UART_TAR register **********************/
#define UART_TAR_TAR_Pos            (0U)
#define UART_TAR_TAR_Msk            (0xFFUL<<UART_TAR_TAR_Pos)                  /*!< 0x000000FF */
#define UART_TAR_TAR                UART_TAR_TAR_Msk                            /*!< Transmit address matching register */

/******************  Bit definition for UART_BRRF register *********************/
#define UART_BRRF_BRRF_Pos          (0U)
#define UART_BRRF_BRRF_Msk          (0xFUL<<UART_BRRF_BRRF_Pos)                 /*!< 0x0000000F */
#define UART_BRRF_BRRF              UART_BRRF_BRRF_Msk                          /*!< Baud rate fractional register */
#define UART_BRRF_BRRF_0            (0x1UL<<UART_BRRF_BRRF_Pos)                 /*!< 0x00000001 */
#define UART_BRRF_BRRF_1            (0x2UL<<UART_BRRF_BRRF_Pos)                 /*!< 0x00000002 */
#define UART_BRRF_BRRF_2            (0x4UL<<UART_BRRF_BRRF_Pos)                 /*!< 0x00000004 */
#define UART_BRRF_BRRF_3            (0x8UL<<UART_BRRF_BRRF_Pos)                 /*!< 0x00000008 */

/******************************************************************************/
/*                                                                            */
/*                     Voltage reference buffer (VREF)                        */
/*                                                                            */
/******************************************************************************/
/****************** Bit definition for VREFBUF_CR register ********************/
#define VREFBUF_CR_VREFBUF_OUT_SEL_Pos            (0U)
#define VREFBUF_CR_VREFBUF_OUT_SEL_Msk            (0x3UL<<VREFBUF_CR_VREFBUF_OUT_SEL_Pos)           /*!< 0x00000003 */
#define VREFBUF_CR_VREFBUF_OUT_SEL                VREFBUF_CR_VREFBUF_OUT_SEL_Msk
#define VREFBUF_CR_VREFBUF_OUT_SEL_0              (0x1UL<<VREFBUF_CR_VREFBUF_OUT_SEL_Pos)           /*!< 0x00000001 */
#define VREFBUF_CR_VREFBUF_OUT_SEL_1              (0x2UL<<VREFBUF_CR_VREFBUF_OUT_SEL_Pos)           /*!< 0x00000002 */
#define VREFBUF_CR_VREFBUF_EN_Pos                 (3U)
#define VREFBUF_CR_VREFBUF_EN_Msk                 (0x1UL<<VREFBUF_CR_VREFBUF_EN_Pos)                /*!< 0x00000008 */
#define VREFBUF_CR_VREFBUF_EN                     VREFBUF_CR_VREFBUF_EN_Msk                         

/** @addtogroup Exported_macros
  * @{
  */

/******************************* ADC Instances ********************************/
#define IS_ADC_ALL_INSTANCE(INSTANCE) ((INSTANCE) == ADC1)

#define IS_ADC_COMMON_INSTANCE(INSTANCE) ((INSTANCE) == ADC)

/******************************* GPIO Instances *******************************/
#define IS_GPIO_ALL_INSTANCE(INSTANCE) (((INSTANCE) == GPIOA) || \
                                        ((INSTANCE) == GPIOB) || \
                                        ((INSTANCE) == GPIOC))

/********************** GPIO Alternate Function Instances *********************/
#define IS_GPIO_AF_INSTANCE(INSTANCE)   IS_GPIO_ALL_INSTANCE(INSTANCE)

/**************************** GPIO Lock Instances *****************************/
#define IS_GPIO_LOCK_INSTANCE(INSTANCE) IS_GPIO_ALL_INSTANCE(INSTANCE)


/****************************** IWDG Instances ********************************/
#define IS_IWDG_ALL_INSTANCE(INSTANCE)  ((INSTANCE) == IWDG)

/****************** LPTIM Instances : All supported instances *****************/
#define IS_LPTIM_INSTANCE(INSTANCE)     ((INSTANCE) == LPTIM)

/****************** LPTIM Instances : All supported instances *****************/
#define IS_LPTIM_ENCODER_INTERFACE_INSTANCE(INSTANCE) ((INSTANCE) == LPTIM)


/****************** TIM Instances : All supported instances *******************/
#define IS_TIM_INSTANCE(INSTANCE)       (((INSTANCE) == TIM1)   || \
                                         ((INSTANCE) == TIM14))

/****************** TIM Instances : supporting the break function *************/
#define IS_TIM_BREAK_INSTANCE(INSTANCE)    (((INSTANCE) == TIM1))

/************** TIM Instances : supporting Break source selection *************/
#define IS_TIM_BREAKSOURCE_INSTANCE(INSTANCE) (((INSTANCE) == TIM1))

/****************** TIM Instances : supporting 2 break inputs *****************/
#define IS_TIM_BKIN2_INSTANCE(INSTANCE)    ((INSTANCE) == TIM1)

/************* TIM Instances : at least 1 capture/compare channel *************/
#define IS_TIM_CC1_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1)   || \
                                         ((INSTANCE) == TIM14))

/************ TIM Instances : at least 2 capture/compare channels *************/
#define IS_TIM_CC2_INSTANCE(INSTANCE)   ((INSTANCE) == TIM1)

/************ TIM Instances : at least 3 capture/compare channels *************/
#define IS_TIM_CC3_INSTANCE(INSTANCE)   ((INSTANCE) == TIM1)

/************ TIM Instances : at least 4 capture/compare channels *************/
#define IS_TIM_CC4_INSTANCE(INSTANCE)   ((INSTANCE) == TIM1)

/******************* TIM Instances : output(s) available **********************/
#define IS_TIM_CCX_INSTANCE(INSTANCE, CHANNEL) \
    ((((INSTANCE) == TIM1) &&                  \
     (((CHANNEL) == TIM_CHANNEL_1) ||          \
      ((CHANNEL) == TIM_CHANNEL_2) ||          \
      ((CHANNEL) == TIM_CHANNEL_3) ||          \
      ((CHANNEL) == TIM_CHANNEL_4)))           \
     ||                                        \
     (((INSTANCE) == TIM14) &&                 \
     (((CHANNEL) == TIM_CHANNEL_1))))

/****************** TIM Instances : supporting complementary output(s) ********/
#define IS_TIM_CCXN_INSTANCE(INSTANCE, CHANNEL) \
   ((((INSTANCE) == TIM1) &&                    \
     (((CHANNEL) == TIM_CHANNEL_1) ||           \
      ((CHANNEL) == TIM_CHANNEL_2) ||           \
      ((CHANNEL) == TIM_CHANNEL_3) ||           \
      ((CHANNEL) == TIM_CHANNEL_4)))            \
    ||                                          \
    (((INSTANCE) == TIM14) &&                   \
     ((CHANNEL) == TIM_CHANNEL_1)))

